docs/serverSetup.tex
% Created 2017-04-10 Mon 15:41
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Justin}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Justin},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.1.1 (Org mode 9.0.5)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Installing Ruby with RVM}
\label{sec:org7777b3d}
Before you can deploy your app on the production server, you need to install Ruby. In this tutorial we recommend that you use Ruby Version Manager (RVM) for this purpose. RVM is a tool for installing and managing multiple Ruby versions.

There are other ways to install Ruby, e.g. through yum, apt-get, source tarball, rbenv and chruby. You can use one of those other installation methods if you so wish, and this tutorial will work fine even if you installed Ruby using one of those other installation methods. But the one that we recommend in this tutorial is RVM, because in our opinion it is the easiest option.

If you have already installed Ruby, then you can skip to the next section

Ensure that curl and gpg are installed, as well as a compiler toolchain. Curl and gpg are needed for further installation steps, while the compiler toolchain is needed for installing common Ruby gems.

Debian, Ubuntu	
\begin{verbatim}
sudo apt-get update
sudo apt-get install -y curl gnupg build-essential
\end{verbatim}
\section{Install RVM}
\label{sec:org85ccdf1}

Run the following commands on your production server to install RVM:

\begin{verbatim}
$ sudo gpg --keyserver hkp://keys.gnupg.net --recv-keys 409B6B1796C275462A1703113804BB82D39DC0E3
$ curl -sSL https://get.rvm.io | sudo bash -s stable
$ sudo usermod -a -G rvm `whoami`
\end{verbatim}

You may need to use gpg2 instead of gpg on some systems.
On systems where sudo is configured with secure \_path, the shell environment needs to be modified to set rvmsudo \_secure \_path=1. secure\(_{\text{path}}\) is set on most Linux systems, but not on OS X. The following command tries to autodetect whether it is necessary to install rvmsudo\(_{\text{secure}}\)\(_{\text{path}}\)=1, and only installs the environment variable if it is the code.
\begin{verbatim}
$ if sudo grep -q secure_path /etc/sudoers; then sudo sh -c "echo export rvmsudo_secure_path=1 >> /etc/profile.d/rvm_secure_path.sh" && echo Environment variable installed; fi
\end{verbatim}

When you are done with all this, relogin to your server to activate RVM. This is important: if you don't relogin, RVM doesn't work. Also if you use gnu screen or another terminal multiplexer, RVM also won't work; you must use a plain ssh session.

\section{Install the Ruby version you want}
\label{sec:org969672b}

Usually, installing the latest Ruby version will suffice. If you are deploying the example app from the quickstart, then that example application works with all Ruby versions.

However, if you are deploying your own app, then your app may have a specific Ruby version requirement.

\subsection{To install the latest version of Ruby, run:}
\label{sec:orgbff34e7}

\begin{verbatim}
$ rvm install ruby
$ rvm --default use ruby
\end{verbatim}
\subsection{To install a specific version of Ruby, run:}
\label{sec:orgf8b28c4}
\begin{verbatim}
$ rvm install ruby-X.X.X
$ rvm --default use ruby-X.X.X
\end{verbatim}

Replace X.X.X with the Ruby version you want.

\section{Install Bundler}
\label{sec:org7283668}

Bundler is a popular tool for managing application gem dependencies. We will use Bundler in this tutorial, so let us install it:

\begin{verbatim}
$ gem install bundler --no-rdoc --no-ri
\end{verbatim}

install Node.js if you're using Rails

If you are using Rails, then you must install Node.js. This is because Rails's asset pipeline compiler requires a Javascript runtime. The Node.js version does not matter.

If you do not use Rails then you can skip to the next step.

To install Node.js:

Ubuntu

\begin{verbatim}
sudo apt-get install -y nodejs &&
sudo ln -sf /usr/bin/nodejs /usr/local/bin/node
sudo node install -g ember
\end{verbatim}

\subsection{Heads-up: sudo vs rvmsudo}
\label{sec:org389d0e1}

One thing you should be aware of when using RVM, is that you should use rvmsudo instead of sudo when executing Ruby-related commands. This is because RVM works by manipulating environment variables. However, sudo nukes all environment variables for security reasons, which intereferes with RVM.

\section{Install Passenger}
\label{sec:org553a279}
\subsection{Step 1: install Passenger packages}
\label{sec:orgbb142bf}

These commands will install Passenger + Nginx through Phusion's APT repository. If you already had Nginx installed, then these commands will upgrade Nginx to Phusion's version (with Passenger compiled in).

Copy\# Install our PGP key and add HTTPS support for APT
\begin{verbatim}
sudo apt-key adv --keyserver hkp://keyserver.ubuntu.com:80 --recv-keys 561F9B9CAC40B2F7
sudo apt-get install -y apt-transport-https ca-certificates

# Add our APT repository
sudo sh -c 'echo deb https://oss-binaries.phusionpassenger.com/apt/passenger xenial main > /etc/apt/sources.list.d/passenger.list'
sudo apt-get update

# Install Passenger + Nginx
sudo apt-get install -y nginx-extras passenger
\end{verbatim}
\subsection{Step 2: enable the Passenger Nginx module and restart}
\label{sec:orge849306}
Edit /etc/nginx/nginx.conf and uncomment include /etc/nginx/passenger.conf;. For example, you may see this:
\begin{verbatim}
# include /etc/nginx/passenger.conf;
\end{verbatim}

Remove the '\#' characters, like this:
\begin{verbatim}
include /etc/nginx/passenger.conf;
\end{verbatim}
If you don't see a commented version of include /etc/nginx/passenger.conf; inside nginx.conf, then you need to insert it yourself. Insert it into /etc/nginx/nginx.conf inside the http block. For example:

Copy\ldots{}
\begin{verbatim}
http {
    include /etc/nginx/passenger.conf;
    ...
}
\end{verbatim}
When you are finished with this step, restart Nginx:
\begin{verbatim}
$ sudo service nginx restart
\end{verbatim}
\subsection{Step 3: check installation}
\label{sec:org328b2dc}

After installation, please validate the install by running sudo /usr/bin/passenger-config validate-install. For example:
\begin{verbatim}
$ sudo /usr/bin/passenger-config validate-install
 * Checking whether this Phusion Passenger install is in PATH... ✓
 * Checking whether there are no other Phusion Passenger installations... ✓
\end{verbatim}

All checks should pass. If any of the checks do not pass, please follow the suggestions on screen.

Finally, check whether Nginx has started the Passenger core processes. Run sudo /usr/sbin/passenger-memory-stats. You should see Nginx processes as well as Passenger processes. For example:

\begin{verbatim}
$ sudo /usr/sbin/passenger-memory-stats
Version: 5.0.8
Date   : 2015-05-28 08:46:20 +0200
...

---------- Nginx processes ----------
PID    PPID   VMSize   Private  Name
-------------------------------------
12443  4814   60.8 MB  0.2 MB   nginx: master process /usr/sbin/nginx
12538  12443  64.9 MB  5.0 MB   nginx: worker process
### Processes: 3
### Total private dirty RSS: 5.56 MB

----- Passenger processes ------
PID    VMSize    Private   Name
--------------------------------
12517  83.2 MB   0.6 MB    PassengerAgent watchdog
12520  266.0 MB  3.4 MB    PassengerAgent server
12531  149.5 MB  1.4 MB    PassengerAgent logger
...
\end{verbatim}
If you do not see any Nginx processes or Passenger processes, then you probably have some kind of installation problem or configuration problem. Please refer to the troubleshooting guide.

\subsection{Step update regularly}
\label{sec:orgc55d344}

Nginx updates, Passenger updates and system updates are delivered through the APT package manager regularly. You should run the following command regularly to keep them up to date:

\begin{verbatim}
$ sudo apt-get update
$ sudo apt-get upgrade
\end{verbatim}

You do not need to restart Nginx or Passenger after an update, and you also do not need to modify any configuration files after an update. That is all taken care of automatically for you by APT.
