docs/serverSetup.tex

\section{PostgreSQL Server Installation}
\label{sec:org1345afc}

To install the server locally use the command line and type:

\begin{verbatim}
$ sudo apt-get install postgresql postgresql-contrib
\end{verbatim}

This will install the latest version available in your Ubuntu release and the commonly used add-ons for it.

See "External Links" below for options for getting newer releases.

\subsection{Server Setup}
\label{sec:org80f2b3c}

If you don't intend to connect to the database from other machines, this alternative setup may be simpler.

By default in Ubuntu, Postgresql is configured to use 'ident sameuser' authentication for any connections from the same machine. Check out the excellent Postgresql documentation for more information, but essentially this means that if your Ubuntu username is 'foo' and you add 'foo' as a Postgresql user then you can connect to the database without requiring a password.

Since the only user who can connect to a fresh install is the postgres user, here is how to create yourself a database account (which is in this case also a database superuser) with the same name as your login name and then create a password for the user:

\begin{verbatim}
sudo -u postgres createuser --superuser $USER
sudo -u postgres psql

postgres=# \password $USER
\end{verbatim}

Client programs, by default, connect to the local host using your Ubuntu login name and expect to find a database with that name too. So to make things REALLY easy, use your new superuser privileges granted above to create a database with the same name as your login name:

\begin{verbatim}
sudo -u postgres createdb $USER
\end{verbatim}

Connecting to your own database to try out some SQL should now be as easy as:

\begin{verbatim}
psql
\end{verbatim}
Creating additional database is just as easy, so for example, after running this:

\begin{verbatim}
create database amarokdb;
\end{verbatim}

You can go right ahead and tell Amarok to use postgresql to store its music catalog. The database name would be amarokdb, the username would be your own login name, and you don't even need a password thanks to 'ident sameuser' so you can leave that blank. 

\section{Transferring the app code to the server}
\label{sec:org0a93ff3}

\subsubsection{Login to your server, create a user for the app}
\label{sec:org50f3a98}

Login to your server with SSH:
\begin{verbatim}
$ ssh adminuser@yourserver.com
\end{verbatim}

Replace adminuser with the name of an account with administrator privileges or sudo privileges.

Starting from this point, unless stated otherwise, all commands that we instruct you to run should be run on the server, not on your local computer!
Now that you have logged in, you should create an operating system user account for your app. For security reasons, it is a good idea to run each app under its own user account, in order to limit the damage that security vulnerabilities in the app can do. Passenger will automatically run your app under this user account as part of its user account sandboxing feature.

\begin{verbatim}
$ sudo adduser ahasuser
\end{verbatim}

We also ensure that that user has your SSH key installed:

\begin{verbatim}
$ sudo mkdir -p ~myappuser/.ssh
$ touch $HOME/.ssh/authorized_keys
$ sudo sh -c "cat $HOME/.ssh/authorized_keys >> ~myappuser/.ssh/authorized_keys"
$ sudo chown -R myappuser: ~myappuser/.ssh
$ sudo chmod 700 ~myappuser/.ssh
$ sudo sh -c "chmod 600 ~myappuser/.ssh/*"
\end{verbatim}

\subsubsection{Install Git on the server}
\label{sec:org432c124}

\begin{verbatim}
$ sudo apt-get install -y git
\end{verbatim}
\subsubsection{Pull code}
\label{sec:org757e675}

You need to pick a location in which to permanently store your application's code. A good location is /var/www/APP \_NAME. Let us create that directory.

\begin{verbatim}
$ sudo mkdir -p /var/www/ahas
$ sudo chown ahasuser: /var/www/ahas
\end{verbatim}

Now let us pull the code from Git:

\begin{verbatim}
$ cd /var/www/myapp
$ sudo -u myappuser -H git clone https://github.com/CMPUT401/ahasServer.git code
\end{verbatim}
Your app's code now lives on the server at /var/www/myapp/code.

\subsection{Preparing the app's environment}
\label{sec:orgb31b939}

\subsubsection{Login as the app's user}
\label{sec:org91290d3}

All subsequent instructions must be run under the application's user account. While logged into your server, login under the application's user account as follows:

\begin{verbatim}
$ sudo -u ahasuser -H bash -l
\end{verbatim}

Since you are using RVM, make sure that you activate the Ruby version that you want to run your app under. For example:

\begin{verbatim}
$ rvm use ruby-2.3.3
\end{verbatim}

\subsubsection{Install app dependencies}
\label{sec:org959f1da}

Your application has various dependencies. They must be installed. Most of these dependencies are gems in your Gemfile, managed by Bundler. You can install them by running bundle install --deployment --without development test -j 2 in your app's directory:

\begin{verbatim}
$ cd /var/www/myapp/code
$ bundle install --deployment --without development test
\end{verbatim}

Your app may also depend on services, such as PostgreSQL, Redis, etc. Installing services that your app depends on is outside of this tutorial's scope.

\subsubsection{Configure database.yml and secrets.yml}
\label{sec:org00956ec}

Since your Rails app probably needs a database, you need to edit config/database.yml. For demonstration purposes, we will setup your app with an SQLite database because that is the easiest.

Open the file:
\begin{verbatim}
$ nano config/database.yml
Ensure that the production section looks like this:
\end{verbatim}


\#+END\(_{\text{SRC}}\)
Rails also needs a unique secret key with which to encrypt its sessions. Starting from Rails 4, this secret key is stored in config/secrets.yml. But first, we need to generate a secret key. Run:


\begin{verbatim}
$ bundle exec rake secret
...
\end{verbatim}
This command will output a secret key. Copy that value to your clipboard. Next, open config/secrets.yml:

\begin{verbatim}
$ nano config/secrets.yml
\end{verbatim}

If the file already exists, look for this:

\begin{verbatim}
production:
  secret_key_base: <%=ENV["SECRET_KEY_BASE"]%>
\end{verbatim}

Then replace it with the following. If the file didn't already exist, simply insert the following.

\begin{verbatim}
production:
  secret_key_base: the value that you copied from 'rake secret'
\end{verbatim}

To prevent other users on the system from reading sensitive information belonging to your app, let's tighten the security on the configuration directory and the database directory:
\begin{verbatim}
$ chmod 700 config db
$ chmod 600 config/database.yml config/secrets.yml
\end{verbatim}

\begin{enumerate}
\item Email
\label{sec:org1840f9d}

The application uses the postmark service, \url{http://www.postmarkapp.com}. You will need to create an account on Postmark, go to an account page and copy the "Account Api Token" that they provide you.
Next, go to config/secrets.yml:

\begin{verbatim}
$ nano config/secrets.yml
\end{verbatim}

Look for this in the file.

\begin{verbatim}
production:
  postmark_api_key: <%= ENV["POSTMARK_API_KEY"] %>
\end{verbatim}

Then replace it with the following.

\begin{verbatim}
production:
  postmark_api_key: the value that you copied from 'http://www.postmarkapp.com'
\end{verbatim}


\item Setting Domain
\label{sec:orgc2c43d1}

We need to set the domain of the application, so that our email client can properly link users to the correct web pages.
Next, go to config/application.rb
\begin{verbatim}
$ nano config/application.rb
\end{verbatim}

Find the following line in the file.

\begin{verbatim}
$ config.domain = ENV["DOMAIN"]
\end{verbatim}

Replace that line with the following.

\begin{verbatim}
$ config.domain = https://www.yourdomain.com
\end{verbatim}
\end{enumerate}

\subsubsection{Compile Rails assets and run database migrations}
\label{sec:org64b621d}

From the root directory run the node build script

\begin{verbatim}
$ ./build.sh
\end{verbatim}

Run the following command to compile assets for the Rails asset pipeline, and to run database migrations:
\begin{verbatim}
$ bundle exec rake assets:precompile db:migrate RAILS_ENV=production
\end{verbatim}
