docs/serverSetup.org
** 3 Configuring Nginx and Passenger

Now that you are done with transferring your app's code to the server and setting up an environment for your app, it is time to configure Nginx so that Passenger knows how to serve your app.

*** 3.1 Determine the Ruby command that Passenger should use

We need to tell Passenger which Ruby command it should use to run your app, just in case there are multiple Ruby interpreters on your system. Please run passenger-config about ruby-command to find out which Ruby interpreter you are using. For example:

#+BEGIN_SRC bash
$ passenger-config about ruby-command
passenger-config was invoked through the following Ruby interpreter:
  Command: /usr/local/rvm/gems/ruby-2.4.0/wrappers/ruby
  ...
#+END_SRC

Please take note of the path after "Command" (in this example, /usr/local/rvm/gems/ruby-2.4.0/wrappers/ruby). You will need it in one of the next steps.

*** 3.2 Go back to the admin account

You have previously logged into your app's user account in order to prepare the app's environment. That user does not have sudo access. In the next steps, you need to edit configuration files, for which sudo access is needed. So you need to switch back to the admin account.

This can be done by simply exiting the shell that was logged into the app's user account. You will then be dropped back to the admin account. For example:

#+BEGIN_SRC bash
# This is what you previously ran:
admin$ sudo -u ahasuser -H bash -l
ahasuser$ ...
#+END_SRC

#+BEGIN_SRC bash
# Type `exit` to go back to the account you were before
ahasuser$ exit
admin$ _
#+END_SRC

*** 3.3 Edit Nginx configuration file

We need to create an Nginx configuration file and setup a virtual host entry that points to your app. This virtual host entry tells Nginx (and Passenger) where your app is located.
#+BEGIN_SRC bash
$ sudo nano /etc/nginx/sites-enabled/ahas.conf
#+END_SRC
Replace myapp with your app's name.

Put this inside the file:
#+BEGIN_SRC text
server {
    listen 80;
    server_name yourserver.com;

    # Tell Nginx and Passenger where your app's 'public' directory is
    root /var/www/myapp/code/public;

    # Turn on Passenger
    passenger_enabled on;
    passenger_ruby /path-to-ruby;
}
#+END_SRC
Replace yourserver.com with your server's host name, and replace /var/www/myapp/code with your application's code directory path. However, make sure that Nginx is configured to point to the public subdirectory inside it!

Replace /path-to-ruby with the Ruby command that you obtained in step 3.1.

When you are done, restart Nginx:

#+BEGIN_SRC bash
$ sudo service nginx restart
#+END_SRC

**** 3.3.1 Setting your SSL certificate

     Because this app handles sensitive information, it is strongly suggested you follow the below guide on setting up an SSL certificate for a ruby on rails app.

     [[https://www.pluralsight.com/guides/ruby-ruby-on-rails/using-https-with-ruby-on-rails][SSL Setup]]

*** 3.4 Test drive

You should now be able to access your app through the server's host name! Try running this from your local computer. Replace yourserver.com with your server's hostname, exactly as it appears in the Nginx config file's server_name directive.

#+BEGIN_SRC bash
$ curl https://yourserver.com/
...your app's front page HTML...
#+END_SRC

If you do not see your app's front page HTML, then these are the most likely causes:

You did not correctly configure your "server_name" directive. The server_name must exactly match the host name in the URL. For example, if you use the command curl http://45.55.91.235/ to access your app, then the server_name must be 45.55.91.235.
You did not setup DNS records. Setting up DNS is outside the scope of this tutorial. In the mean time, we recommend that you use your server's IP address as the server name.
