docs/serverSetup.tex

\subsection{Configuring Nginx and Passenger}
\label{sec:org750542b}

Now that you are done with transferring your app's code to the server and setting up an environment for your app, it is time to configure Nginx so that Passenger knows how to serve your app.

\subsubsection{Determine the Ruby command that Passenger should use}
\label{sec:org45c3408}

We need to tell Passenger which Ruby command it should use to run your app, just in case there are multiple Ruby interpreters on your system. Please run passenger-config about ruby-command to find out which Ruby interpreter you are using. For example:

\begin{verbatim}
$ passenger-config about ruby-command
passenger-config was invoked through the following Ruby interpreter:
  Command: /usr/local/rvm/gems/ruby-2.4.0/wrappers/ruby
  ...
\end{verbatim}

Please take note of the path after "Command" (in this example, /usr/local/rvm/gems/ruby-2.4.0/wrappers/ruby). You will need it in one of the next steps.

\subsubsection{Go back to the admin account}
\label{sec:org4062898}

You have previously logged into your app's user account in order to prepare the app's environment. That user does not have sudo access. In the next steps, you need to edit configuration files, for which sudo access is needed. So you need to switch back to the admin account.

This can be done by simply exiting the shell that was logged into the app's user account. You will then be dropped back to the admin account. For example:

\begin{verbatim}
# This is what you previously ran:
admin$ sudo -u ahasuser -H bash -l
ahasuser$ ...
\end{verbatim}

\begin{verbatim}
# Type `exit` to go back to the account you were before
ahasuser$ exit
admin$ _
\end{verbatim}

\subsubsection{Edit Nginx configuration file}
\label{sec:org523855f}

We need to create an Nginx configuration file and setup a virtual host entry that points to your app. This virtual host entry tells Nginx (and Passenger) where your app is located.
\begin{verbatim}
$ sudo nano /etc/nginx/sites-enabled/ahas.conf
\end{verbatim}
Replace myapp with your app's name.

Put this inside the file:
\begin{verbatim}
server {
    listen 80;
    server_name yourserver.com;

    # Tell Nginx and Passenger where your app's 'public' directory is
    root /var/www/myapp/code/public;

    # Turn on Passenger
    passenger_enabled on;
    passenger_ruby /path-to-ruby;
}
\end{verbatim}
Replace yourserver.com with your server's host name, and replace /var/www/myapp/code with your application's code directory path. However, make sure that Nginx is configured to point to the public subdirectory inside it!

Replace /path-to-ruby with the Ruby command that you obtained in step 3.1.

When you are done, restart Nginx:

\begin{verbatim}
$ sudo service nginx restart
\end{verbatim}

\begin{enumerate}
\item Setting your SSL certificate
\label{sec:org57e3e92}

Because this app handles sensitive information, it is strongly suggested you follow the below guide on setting up an SSL certificate for a ruby on rails app.

\href{https://www.pluralsight.com/guides/ruby-ruby-on-rails/using-https-with-ruby-on-rails}{SSL Setup}
\end{enumerate}

\subsubsection{Test drive}
\label{sec:org2540b70}

You should now be able to access your app through the server's host name! Try running this from your local computer. Replace yourserver.com with your server's hostname, exactly as it appears in the Nginx config file's server\(_{\text{name}}\) directive.

\begin{verbatim}
$ curl https://yourserver.com/
...your app's front page HTML...
\end{verbatim}

If you do not see your app's front page HTML, then these are the most likely causes:

You did not correctly configure your server \_name directive. The server \_name must exactly match the host name in the URL. For example, if you use the command curl \url{http://45.55.91.235/} to access your app, then the server\(_{\text{name}}\) must be 45.55.91.235.
You did not setup DNS records. Setting up DNS is outside the scope of this tutorial. In the mean time, we recommend that you use your server's IP address as the server name.
\end{document}
